Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartData
The data of part.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartData.PartId
Gets or sets the part identifier.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartData.Bars
Gets or sets the part bar data.